rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
                if (time < 20.0f)
                {
                    g_sysData.searchProgress = 100;
                    Transport_Stop();
                    searching = FALSE;
#if (TTY_DEBUG_MSGS > 0)
                    //CLI_printf("ZERO CROSSED cue=%d, abs=%d\n", cue_dist, abs_dist);
#endif
                }
                break;

            default:
			    /* invalid state! */
			    searching = FALSE;
			    break;
			}

	        /* Send TCP state change notification */
	        Event_post(g_eventTransport, Event_Id_00);

			/* Check for a new locate command. It's possible the user may have requested
			 * a new locate cue point while a locate command was already in progress.
			 * If so, we cancel the current locate request and reset to start searching
			 * at the new cue point requested.
			 */

			if (!searching)
                break;

	        if (Mailbox_pend(g_mailboxLocate, &msg, 2))
	        {
	            /* Abort search loop if cancel requested */
                if (msg.command == LOCATE_CANCEL)
                {
                    searching = FALSE;
#if (TTY_DEBUG_MSGS > 0)
        CLI_printf("*** USER SEARCH CANCEL ***\n");
#endif
                    break;
                }
                else if (msg.command == LOCATE_SEARCH)
	            {
                    /* New search requested! */

                    cue_index = (size_t)msg.param1;
                    cue_flags = msg.param2;

                    if (cue_index >= MAX_CUE_POINTS)
                        break;

                    /* Is the cue point is active? */
                    if (g_sysData.cuePoint[cue_index].flags == 0)
                        break;

                    /* Clear the global search cancel flag */
                    key = Hwi_disable();
                    g_sysData.searching = TRUE;
                    g_sysData.searchCancel = FALSE;
                    g_sysData.searchProgress = 0;
                    Hwi_restore(key);

                    /* Set SEARCHING_OUT status i/o pin */
                    GPIO_write(Board_SEARCHING, PIN_LOW);

                    /* If user cue memory, turn on the button LED */
                    if (cue_index < USER_CUE_POINTS)
                        SetLocateButtonLED(cue_index);

                    /* Set transport to STOP mode initially */
                    Transport_Stop();

                    /* Save cue from distance */
                    cue_from = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

                    if (!cue_from)
                        cue_from = 1;

                    state = LOCATE_START_STATE;
	            }
	        }

	        /* Abort if transport halted, must be tape out? */
            if (IsTransportHaltMode())
                break;

	        /* Exit if user search cancel */
            if (!searching || g_sysData.searchCancel)
                break;
	    }

#if (TTY_DEBUG_MSGS > 0)
	    CLI_printf("\n** SEARCH END **\n");
#endif
        /* Set SEARCHING_OUT status i/o pin */
        GPIO_write(Board_SEARCHING, PIN_HIGH);

        /* Clear the search in progress flag */
        key = Hwi_disable();
        cancel = g_sysData.searchCancel;
        g_sysData.searching = FALSE;
        g_sysData.searchCancel = FALSE;
        Hwi_restore(key);

        /* Send TCP state change notification */
        Event_post(g_eventTransport, Event_Id_00);

        /* Send STOP button pulse to stop transport */
	    if (!cancel)
	    {
	        Transport_Stop();

	        if (cue_flags & CF_AUTO_PLAY)
	        {
                if (cue_flags & CF_AUTO_REC)
                    Transport_Play(M_RECORD);
                else
                    Transport_Play(0);
	        }
	    }
    }
}

/*****************************************************************************
 * HELPER FUNCTIONS
 *****************************************************************************/

//*****************************************************************************
// Pulse and I/O line LOW for the specified ms duration. The following
// gpio lines are used to control the transport directly. Index should
// be one of the following for the transport control buttons:
//
//   Board_STOP_N
//   Board_PLAY_N
//   Board_FWD_N
//   Board_REW_N
//
//*****************************************************************************

#if 0
#define BUTTON_PULSE    50

void GPIOPulseLow(uint32_t index, uint32_t duration)
{
    /* Set the i/o pin to low state */
    GPIO_write(index, PIN_LOW);
    /* Sleep for pulse duration */
    Task_sleep(duration);
    /* Return i/o pin to high state */
    GPIO_write(index, PIN_HIGH);
}
#endif

/* End-Of-File */
